VPro/src/InformationRegisters/PermissionQueriesOnUseExternalResources/PermissionQueriesOnUseExternalResources.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>PermissionQueriesOnUseExternalResources</name>
  <resources>
    <name>SoftwareModuleType</name>
    <type>
      <types>CatalogRef.MetadataObjectIDs</types>
    </type>
  </resources>
  <resources>
    <name>SoftwareModuleID</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>OwnerType</name>
    <type>
      <types>CatalogRef.MetadataObjectIDs</types>
    </type>
  </resources>
  <resources>
    <name>IDOwner</name>
    <type>
      <types>UUID</types>
    </type>
  </resources>
  <resources>
    <name>SafeMode</name>
    <type>
      <types>DefinedType.SafeMode</types>
    </type>
  </resources>
  <attributes>
    <name>Operation</name>
    <type>
      <types>EnumRef.OperationsAdministrationSecurityProfiles</types>
    </type>
  </attributes>
  <attributes>
    <name>Name</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ReplacementMode</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>PermissionsToBeAdded</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>PermissionsToBeDeleted</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>AdministrationQuery</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>IDRequest</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

VPro/src/InformationRegisters/ExternalModulesConnectionModes/ExternalModulesConnectionModes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ExternalModulesConnectionModes</name>
  <resources>
    <name>SafeMode</name>
    <type>
      <types>DefinedType.SafeMode</types>
    </type>
  </resources>
  <attributes>
    <name>SoftwareModulePresentation</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>SoftwareModuleType</name>
    <type>
      <types>AnyRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>SoftwareModuleID</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

VPro/src/InformationRegisters/PermissionQueriesOnUseExternalResources/RecordSetModule.bsl
#If Server Or ThickClientOrdinaryApplication Or ExternalConnection Then

#Region ServiceProceduresAndFunctions

Procedure OnWrite(Cancel, Replacing)
	
	If WorkInSafeMode.SafeModeIsSet() Then
		
		CurrentSafeMode = SafeMode();
		
		For Each Record IN ThisObject Do
			
			If Record.SafeMode <> CurrentSafeMode Then
				
				Raise StringFunctionsClientServer.SubstituteParametersInString(
					NStr("en='Safe mode %1 differs from current %2';ru='Безопасный режим %1 отличается от текущего %2';vi='Chế độ an toàn %1 khác với chế độ hiện tại %2'"),
					Record.SafeMode, CurrentSafeMode);
				
			EndIf;
			
			ProgramModule = WorkInSafeModeService.RefFromPermissionsRegister(
				Record.OwnerType, Record.SoftwareModuleID);
			
			If ProgramModule <> Catalogs.MetadataObjectIDs.EmptyRef() Then
				
				SoftwareModuleSafeMode = InformationRegisters.ExternalModulesConnectionModes.ExternalModuleConnectionMode(
					ProgramModule);
				
				If Record.SafeMode <> SoftwareModuleSafeMode Then
					
					Raise StringFunctionsClientServer.SubstituteParametersInString(
						NStr("en='The permission query cannot be executed from safe mode %2 for application module %1';ru='Для программного модуля %1 не может быть выполнен запрос разрешений из безопасного режима %2';vi='Đối với mô-đun chương trình %1 không thể thực hiện truy vấn cho phép từ chế độ an toàn %2'"),
						String(ProgramModule), Record.SafeMode);
					
				EndIf;
				
			EndIf;
			
		EndDo;
		
	EndIf;
	
	If DataExchange.Load Then
		Return;
	EndIf;
	
EndProcedure

#EndRegion

#EndIf
